<template>
  <div class="contract-offer">
    <h1 class="contract-offer__heading title">Публичная оферта (предложение) интернет-магазина "rosso.su" о продаже товаров</h1>
    <ul class="contract-offer__list">
      <!-- Item -->
      <li class="contract-offer__item">
        <h3 class="contract-offer__title title">1. Термины и определения</h3>
        <div class="contract-offer__content">
          <div class="contract-offer__text body-1">
            <p>1.1. В настоящей оферте, если контекст не требует иного, нижеприведенные термины имеют следующие значения и являются ее составной неотъемлемой частью:
            <br>
            Продавец — компания «РОССО» (Фактический адрес: 195197, г. Санкт-Петербург, просп. Полюстровский, д.50. (офис, торговый зал), тел.: 8 (812) 380-66-86, e-mail: info@rosso.su.</p>
            <p>Покупатель — любое физическое лицо, акцептировавшее публичную оферту на условиях настоящей оферты.</p>
            <p>Интернет-магазин — официальный интернет-магазин Продавца компания «РОССО», расположенный по интернет адресу "https://rosso.su". В рамках настоящего договора, понятия Интернет-магазин и Магазин, а также интернет адреса https://rosso.su и производные от “rosso.su” являются равносильными и трактуются аутентично, по контексту оферты.</p>
            <p>Товар — объект соглашения сторон, перечень наименований ассортимента, представленный в официальном интернет-магазине.</p>
          </div>
        </div>
      </li>
      <!-- Item -->
      <li class="contract-offer__item">
        <h3 class="contract-offer__title title">2. Общие положения</h3>
        <div class="contract-offer__content">
          <div class="contract-offer__text body-1">
            <p>2.1. Настоящая публичная Оферта (в дальнейшем — Договор) является официальным предложением Продавца в адрес любого физического лица, обладающего дееспособностью и необходимым полномочием заключить с Продавцом договор купли-продажи Товара на условиях, определенных в настоящей оферте, и содержит все существенные условия договора.</p>
            <p>2.2. Отношения в области защиты прав потребителей регулируются Гражданским кодексом Российской Федерации, Законом «О защите прав потребителей» и принимаемыми в соответствии с ним иными федеральными законами и правовыми актами Российской Федерации.</p>
          </div>
        </div>
      </li>
      <!-- Item -->
      <li class="contract-offer__item">
        <h3 class="contract-offer__title title">3. Регистрация на сайте</h3>
        <div class="contract-offer__content">
          <div class="contract-offer__text body-1">
            <p>3.1. Оформить Заказ в Интернет-магазине могут только зарегистрированные Покупатели, при этом Покупатель вправе зарегистрироваться на сайте только 1(один) раз, т.е. может иметь только один Личный кабинет.</p>
            <p>3.2. Продавец не несет ответственности за точность и правильность информации, предоставляемой Покупателем при регистрации.</p>
            <p>3.3. Покупатель, зарегистрировавшийся в Интернет-магазине, получает индивидуальную идентификацию путем предоставления логина и пароля. Индивидуальная идентификация Покупателя позволяет избежать несанкционированных действий третьих лиц от имени Покупателя и открывает доступ к дополнительным сервисам. Передача Покупателем логина и пароля третьим лицам запрещена.</p>
            <p>3.4. Покупатель самостоятельно несёт ответственность за все возможные негативные последствия, в случае передачи логина и пароля третьим лицам.</p>
          </div>
        </div>
      </li>
      <!-- Item -->
      <li class="contract-offer__item">
        <h3 class="contract-offer__title title">4. Предмет Договора и цена Товара</h3>
        <div class="contract-offer__content">
          <div class="contract-offer__text body-1">
            <p>4.1. Продавец передает, а Покупатель принимает и оплачивает товары на условиях настоящего Договора.</p>
            <p>4.2. Право собственности на Заказанные Товары переходит к Покупателю с момента фактической передачи Товара Покупателю и оплаты последним полной стоимости Товара. Риск его случайной гибели или повреждения Товара переходит к Покупателю с момента фактической передачи Товара Покупателю.</p>
            <p>4.3. Цены на Товар определяются Продавцом в одностороннем бесспорном порядке и указываются на страницах интернет-магазина, расположенного по интернет-адресу: https://rosso.su.</p>
            <p>4.4. Цена товара указывается в рублях Российской Федерации и включает в себя налог на добавленную стоимость.</p>
            <p>4.5. Вид и стоимость доставки заказов (если доставка требуется Покупателю) определяются отдельно и согласовываются совместно с Покупателем и менеджером интернет-магазина по телефону или в переписке через электронную почту Продавца info@rosso.su.</p>
          </div>
        </div>
      </li>
      <!-- Item -->
      <li class="contract-offer__item">
        <h3 class="contract-offer__title title">5. Момент заключения договора</h3>
        <div class="contract-offer__content">
          <div class="contract-offer__text body-1">
            <p>5.1. Текст данного Договора является публичной офертой (в соответствии со статьёй 435 и частью 2 статьи 437 Гражданского кодекса Российской Федерации).</p>
            <p>5.2. Акцепт настоящей оферты (договора) — оформление Покупателем заказа на Товар в соответствии с условиями настоящей оферты.</p>
            <ul>
              5.3. Акцептируя настоящую оферту, Покупатель выражает согласие в том, что:
              <li>регистрационные данные (в том числе персональные данные) указаны им добровольно</li>
              <li>регистрационные данные (в том числе персональные данные) передаются в электронной форме по открытым каналам связи сети «Интернет»</li>
              <li>регистрационные данные (в том числе персональные данные) переданы Продавцу для реализации целей, указанных в настоящей оферте и могут быть переданы третьим лицам, только для реализации целей, указанных в настоящей оферте</li>
              <li>регистрационные данные (в том числе персональные данные) могут быть использованы Продавцом в целях продвижения товаров и услуг, путем осуществления прямых контактов с Покупателем с помощью каналов связи</li>
              <li>в целях дополнительной защиты от мошеннических действий указанные Покупателем регистрационные данные (в том числе персональные данные) могут быть переданы банку, осуществляющему транзакции по оплате оформленных на https://rosso.su заказов</li>
              <li>данное Покупателем согласие на обработку его регистрационных данных (в том числе персональных данных) является бессрочным и может быть отозвано Покупателем или его законным представителем, подачей письменного заявления, переданного Продавцу на пункте самовывоза</li>
            </ul>
            <p>5.4. Договор, заключаемый на основании акцептирования Покупателем настоящей оферты является договором присоединения, к которому Покупатель присоединяется без каких-либо исключений и/или оговорок.</p>
            <p>5.5. Факт оформления заказа Покупателем является безоговорочным фактом принятия Покупателем условий данного Договора, в том числе согласием Покупателя на рассылку ему Продавцом смс-сообщений о статусе его заказа и опросов для улучшения качества обслуживания Покупателей. Покупатель, приобретший товар в Интернет-магазине Продавца (оформивший заказ товара), рассматривается как лицо, вступившее с продавцом в отношения на условиях настоящего Договора.</p>
          </div>
        </div>
      </li>
      <!-- Item -->
      <li class="contract-offer__item">
        <h3 class="contract-offer__title title">6. Права и обязанности сторон</h3>
        <div class="contract-offer__content">
          <div class="contract-offer__text body-1">
            <p class="subtitle-lg">6.1. Продавец обязуется:</p>
            <p>6.1.1. С момента заключения настоящего Договора обеспечить в полной мере все обязательства перед Покупателем в соответствии с условиями настоящего договора и действующего законодательства. Продавец оставляет за собой право невыполнения обязательств по Договору в случае возникновения обстоятельств непреодолимой силы, указанных в п.6 настоящего Договора.</p>
            <p>6.1.2. Обрабатывать персональные данные Покупателя в порядке, установленном действующим законодательством в отношении организации обработки и обеспечения безопасности персональных данных.</p>
            <p>6.1.3. В случае достижения цели обработки персональных данных Продавец обязуется прекратить обработку персональных данных или обеспечить ее прекращение (если обработка персональных данных осуществляется другим лицом, действующим по поручению Продавца) и уничтожить персональные данные или обеспечить их уничтожение (если обработка персональных данных осуществляется другим лицом, действующим по поручению Продавца) в срок, не превышающий тридцати дней с даты достижения цели обработки персональных данных, если иное не предусмотрено договором, стороной которого, выгодоприобретателем или поручителем по которому является Покупатель, иным соглашением между Продавцом и Покупателем.</p>
            <p>6.1.4. В случае отзыва Покупателем согласия на обработку его персональных данных Продавец обязуется прекратить их обработку или обеспечить прекращение такой обработки (если обработка персональных данных осуществляется другим лицом, действующим по поручению Продавца) и в случае, если сохранение персональных данных более не требуется для целей обработки персональных данных, уничтожить персональные данные или обеспечить их уничтожение (если обработка персональных данных осуществляется другим лицом, действующим по поручению Продавца) в срок, не превышающий тридцати дней с даты поступления указанного отзыва, если иное не предусмотрено договором, стороной которого, выгодоприобретателем или поручителем по которому является Покупатель.</p>
            <p class="subtitle-lg">6.2. Продавец имеет право:</p>
            <p>6.2.1. Изменять настоящий Договор, Цены на Товар и Тарифы на сопутствующие услуги, способы и сроки оплаты и доставки товара в одностороннем порядке, помещая их на страницах интернет-магазина, расположенного по интернет-адресу: https://rosso.su. Все изменения вступают в силу немедленно после публикации, и считаются доведенными до сведения Покупателя с момента такой публикации.</p>
            <p>6.2.2. Осуществлять записи телефонных переговоров с Покупателем. В соответствии с п. 4 ст. 16 Федерального закона «Об информации, информационных технологиях и о защите информации» Продавец обязуется: предотвращать попытки несанкционированного доступа к информации и/или передачу ее лицам, не имеющим непосредственного отношения к исполнению Заказов, своевременно обнаруживать и пресекать такие факты.</p>
            <p>6.2.3. Без согласования с Покупателем, передавать свои права и обязанности по исполнению Договора третьим лицам.</p>
            <ul>
              6.2.4. Перед поставкой заказанного Клиентом товара Продавец имеет право потребовать от Клиента 100% предоплаты заказанного товара. Продавец имеет право отказать Клиенту в доставке товара при отсутствии такой оплаты. Продавец имеет право потребовать от Клиента 100% предоплаты заказанного товара в следующих случаях:
              <li>в случае нарушения одного из пунктов оферты 3.1; 7.5; 7.6</li>
              <li>в случае нарушения правил продаж</li>
            </ul>
            <p>6.2.5. Продавец вправе не производить доставку Товара Клиенту курьером, в том числе без 100% предоплаты заказанного Товара, по адресу, указанному при оформлении Клиентом заказа, и передать Товар в согласованном с Клиентом фирменном пункте самовывоза.</p>
            <p>6.2.6. Продавец вправе произвести ограничения одновременно доставляемого Клиенту Товара.</p>
            <p>6.2.7. Использовать технологию «cookies». «Cookies» не содержат конфиденциальную информацию и не передаются третьим лицам.</p>
            <p>6.2.8. Получать информацию об ip — адресе посетителя Сайта https://rosso.su. Данная информация не используется для установления личности посетителя и не подлежит передаче третьим лицам.</p>
            <p>6.2.9. Продавец вправе направлять Покупателю сообщения рекламно-информационного характера посредством e-mail и sms-рассылок с информацией о скидках, акциях, новых поступлениях и т.п. Частота рассылок определяется Продавцом самостоятельно, в одностороннем порядке, но не более 2-х раз в месяц.</p>
            <p>6.2.10. Продавец вправе в одностороннем порядке отменить Заказ Покупателя в случае нарушения Покупателем п.6.3.3.1. настоящей Оферты.</p>
            <p>6.2.11. Продавец вправе произвести ограничения по сумме заказываемых товаров на один день доставки.</p>
            <p>6.2.12. Продавец вправе изменять условия Акций, размещённых на сайте интернет-магазина https://rosso.su, в одностороннем порядке без согласия Покупателя, путём размещения таких изменений на сайте интернет-магазина https://rosso.su.</p>
            <p>6.2.13. При доставке предоплаченного заказа, курьер или сотрудник пункта самовывоза может попросить Клиента предъявить документ удостоверяющий личность. Если получать заказ будет не владелец Личного кабинета, ФИО получателя необходимо указать в специальном окне при оформлении заказа. В случае, если данные владельца Личного Кабинета не совпадают с данными в документе удостоверяющим личность, интернет-магазин в праве отказать Клиенту в выдаче товара.</p>
            <p class="subtitle-lg">6.3. Покупатель обязуется:</p>
            <p>6.3.1. До момента заключения Договора ознакомиться с содержанием и условиями Договора, ценами на Товар, предлагаемыми Продавцом в интернет-магазине.</p>
            <p>6.3.2. Во исполнение Продавцом своих обязательств перед Покупателем последний должен сообщить все необходимые данные, однозначно идентифицирующие его как покупателя, и достаточные для доставки Покупателю оплаченного им Товара.</p>
            <p>6.3.3. Оплатить заказанный Товар и его доставку на условиях настоящего договора.</p>
            <p>6.3.4. Если Покупатель при оформлении Заказа указывает безналичный способ оплаты Заказа (банковской картой либо системой электронных платежей), то Покупатель обязан оплатить свой Заказ в течение 24 часов с момента оформления. Соблюдать Правила продажи.</p>
            <p class="subtitle-lg">6.4.Покупатель имеет право:</p>
            <p>6.4.1. Покупатель вправе отказаться от получения e-mail и sms-рассылок.</p>
          </div>
        </div>
      </li>
      <!-- Item -->
      <li class="contract-offer__item">
        <h3 class="contract-offer__title title">7. Доставка товара </h3>
        <div class="contract-offer__content">
          <div class="contract-offer__text body-1">
            <p>7.1. Доставка Товара Покупателю осуществляется в сроки, согласованные Сторонами при подтверждении заказа сотрудником Продавца и условиях, изложенных в Правилах продажи. Если Покупатель не забирает свой заказ в назначенном и согласованном ранее пункте выдачи заказов в согласованный срок, Продавец вправе аннулировать заказ без дополнительного информирования Клиента. В случае, если заказ предоплачен, денежные средства возвращаются покупателю в установленный законодательством срок.</p>
            <p>7.2. При курьерской доставке Товара Клиент в реестре Доставки ставит свою подпись напротив тех позиций Товара, которые Клиент приобрел. Данная подпись служит подтверждением того, что Клиент не имеет претензий к комплектации заказа, к количеству и внешнему виду Товара.</p>
            <p>7.3. После получения Заказа претензии к количеству, комплектности и виду Товара не принимаются.</p>
            <p>7.4. Курьерская доставка может быть осуществлена по указанному в Личном Кабинете адресу.</p>
            <p>7.5. В случае, если курьерская доставка осуществляется в публичном месте (вокзал, парк, магазин, ресторан, торговые центры и т.п.), передача заказа и расчет с Курьером возможен только в офисной части, в ином случае, передача заказа может быть осуществлена только после внесения Клиентом 100% предоплаты.</p>
            <p>7.6. Проверка заказанного Товара, как и все взаиморасчеты с Курьером производятся не более, чем за 20 минут.</p>
          </div>
        </div>
      </li>
      <!-- Item -->
      <li class="contract-offer__item">
        <h3 class="contract-offer__title title">8. Отзыв оферты</h3>
        <div class="contract-offer__content">
          <p class="contract-offer__text body-1">
            8.1. Отзыв оферты (Договора) может быть осуществлён Продавцом в любое время, но это не является основанием для отказа от обязательств Продавца по уже заключённым договорам. Продавец обязуется разместить уведомление об отзыве оферты, в своем интернет-магазине, с указанием точного времени (4-й часовой пояс (Москва)) отзыва оферты, не менее чем за 12 часов до факта наступления события отзыва (приостановки) действия Оферты.
          </p>
        </div>
      </li>
      <!-- Item -->
      <li class="contract-offer__item">
        <h3 class="contract-offer__title title">9. Форс-мажор</h3>
        <div class="contract-offer__content">
          <p class="contract-offer__text body-1">
            9.1. Любая из Сторон освобождается от ответственности за полное или частичное неисполнение своих обязательств по настоящему Договору, если это неисполнение было вызвано обстоятельствами непреодолимой силы, возникшими после подписания настоящего Договора. «Обстоятельства Непреодолимой Силы», означают чрезвычайные события или обстоятельства, которые такая Сторона не могла предвидеть или предотвратить доступными ей средствами. Такие чрезвычайные события или обстоятельства включают в себя, в частности: забастовки, наводнения, пожары, землетрясения и иные стихийные бедствия, войны, военные действия, действия российских или иностранных государственных органов, а также любые иные обстоятельства, выходящие за пределы разумного контроля любой из Сторон. Изменения действующего законодательства или нормативных актов, прямо или косвенно влияющие на какую-либо из Сторон, не рассматриваются как Обстоятельства непреодолимой силы, однако, в случае внесения таких изменений, которые не позволяют любой из Сторон исполнить какие-либо из ее обязательств по настоящему Договору, Стороны обязаны незамедлительно принять решение относительно порядка работы по устранению этой проблемы с тем, чтобы обеспечить Сторонам продолжение исполнения настоящего Договора.
          </p>  
        </div>
      </li>
      <!-- Item -->
      <li class="contract-offer__item">
        <h3 class="contract-offer__title title">10. Прочие условия </h3>
        <div class="contract-offer__content">
          <div class="contract-offer__text body-1">
            <p>10.1. Все споры, связанные с неисполнением, или ненадлежащим исполнением своих обязательств по настоящему договору стороны будут стараться решить в ходе переговоров.</p>
            <p>10.2. В случае не достижения согласия в ходе переговоров, споры будут разрешаться в судебном порядке в соответствии с действующим законодательством Российской Федерации.</p>
          </div>
        </div>
      </li>
    </ul>
  </div>
</template>

<script>
export default {
  
}
</script>

<style lang="scss">
.contract-offer {
  &__heading {
    padding: 150px 160px 50px;

    @include laptop {
      padding: 142px 114px 35px;
    }

    @include small-tablet {
      padding: 104px 66px 35px;
    }

    @include mobile {
      padding: 60px 30px 20px;
    }
  }

  &__title {
    padding: 120px 160px 30px;
    border-top: $light-gray-line;
    border-bottom: $light-gray-line;

    @include laptop {
      padding: 90px 118px 30px;
    }

    @include small-tablet {
      padding: 67px 62px 30px;
    } 

    @include mobile {
      padding: 40px 30px 20px;
    }
  }

  &__content {
    display: grid;
    grid-template-columns: repeat(24, 1fr);

    @include mobile {
      display: block;
    }
  }

  &__text {
    display: flex;
    flex-direction: column;
    gap: 25px;
    padding: 90px 160px 160px 80px;
    grid-column: 9 / 25;

    border-left: $light-gray-line;

    @include laptop {
      padding: 64px 114px 90px 57px;
    }

    @include small-tablet {
      grid-column: 7 / 25;
    }

    @include small-tablet {
      padding-top: 44px;
    } 

    @include mobile {
      padding: 64px 50px 90px 100px;
    }

    @include small-mobile {
      padding: 30px;
      padding-right: 40px;
    }

    li {
      &:before {
        content: '— ';
      }
    }
  }
}
</style>