<template>
  <div class="exchange">
    <div class="exchange__title">
      <h1 class="title">Условия возврата/обмена</h1>
    </div>
    <span class="empty"></span>
    <div class="exchange__text body-1">
      <p>
        Покупатель имеет право на обмен непродовольственного товара надлежащего качества в течение 14 дней, не считая дня его покупки.
        <br>
        Обмен товара надлежащего качества возможен, если указанный товар не был в употреблении, сохранены его товарный вид, потребительские свойства, пломбы, фабричные ярлыки, а также имеется товарный или кассовый чек, либо иной подтверждающий оплату указанного товара документ.
      </p>
      <p>
        Обмен и возврат товара ненадлежащего качества, товара имеющего гарантийные сроки осуществляется на основании заявления от покупателя на имя генерального директора, ежедневно с 10 до 18 часов (Согласно Закона РФ № 2300-1 “О защите прав потребителей” от 07.02.92 г.).
        <br>
        Обмен и возврат товара осуществляется ежедневно с 10 до 18 часов в магазине (по тому же адресу), где был приобретен этот товар.
        <br>
        Обмен и возврат товара осуществляется при наличии чека и документа, удостоверяющего личность (паспорта или документа, его заменяющего).
        <br>
        Если товар был оплачен банковской картой, то её необходимо иметь при себе, поскольку возврат денежных средств за товар осуществляется безналичным путем на карту держателя при предоставлении чека платежного терминала.
      </p>
      <p>
        Гарантийные сроки на Товары определяются изготовителями (производителями) и исчисляются с момента передачи Товара Покупателю. Условием бесплатного гарантийного обслуживания является использование Товара по его прямому назначению, а также соблюдение установленных правил эксплуатации Товара.
      </p>
      <p>
        Под понятием «Гарантийное обслуживание» понимается устранение Продавцом недостатков, возникших после приемки Товара Покупателем (Получателем) и выявленные в процессе эксплуатации.
        <br>
        Гарантия не распространяется на естественный износ составных частей или деталей Товара, или дефекты, возникшие в результате неправильной эксплуатации Товара или использования Товара не по назначению.
        <br>
        В случае приобретения Товара дистанционным способом, исключающим возможность непосредственного ознакомления потребителя с товаром либо образцом, Потребитель вправе отказаться от товара надлежащего качества в любое время до его передачи, а после передачи товара - в течение семи дней (в соответствии со ст. 26.1 Закона о защите прав потребителей от 07.02.1992 № 2300-1).
      </p>
    </div>
  </div>
</template>

<script>
export default {
  
}
</script>

<style lang="scss">
.exchange {
  display: grid;
  grid-template-columns: repeat(24, 1fr);
  grid-template-rows: 1fr auto;

  &__title {
    display: flex;
    align-items: flex-end;
    grid-area: 1 / 1 / 2 / 17;
    padding: 200px 0 50px 162px;

    border-right: $light-gray-line;
    border-bottom: $light-gray-line;

    @include small-tablet {
      padding: 16px 67px;
      padding-top: 60px;
      grid-area: 1 / 1 / 2 / 25;
    }
  }

  .empty {
    grid-area: 1 / 17 / 2 / 25;
    border-bottom: $light-gray-line;

    @include small-tablet {
      display: none;
    }
  }

  &__text {
    display: flex;
    flex-direction: column;
    gap: 30px;
    padding: 90px 80px;
    padding-right: 160px;
    grid-area: 2 / 9 / 3 / 25;
    border-left: $light-gray-line;

    @include tablet {
      padding-right: 80px;  
    }

    @include small-tablet {
      padding: 42px 32px 58px;
      grid-area: 2 / 6 / 3 / 25;
    }
  }
}
</style>